In [2]:
import pymysql
pymysql.install_as_MySQLdb()

In [4]:
from sqlalchemy import create_engine
import pandas as pd
from urllib.parse import quote_plus
from sqlalchemy import text

In [8]:
username = 'root'
password = quote_plus('Vis688131!')
db_name = 'sakila'
connection = f'mysql+pymysql://{username}:{password}@localhost/{db_name}'

In [7]:
engine = create_engine(connection)
conn = engine.connect()

In [13]:
q = """SELECT * FROM actor;"""
pd.read_sql(q, conn)

     actor_id first_name     last_name         last_update
0           1   PENELOPE       GUINESS 2006-02-14 12:34:33
1           2       NICK      WAHLBERG 2006-02-14 12:34:33
2           3         ED         CHASE 2006-02-14 12:34:33
3           4   JENNIFER         DAVIS 2006-02-14 12:34:33
4           5     JOHNNY  LOLLOBRIGIDA 2006-02-14 12:34:33
..        ...        ...           ...                 ...
195       196       BELA        WALKEN 2006-02-14 12:34:33
196       197      REESE          WEST 2006-02-14 12:34:33
197       198       MARY        KEITEL 2006-02-14 12:34:33
198       199      JULIA       FAWCETT 2006-02-14 12:34:33
199       200      THORA        TEMPLE 2006-02-14 12:34:33

[200 rows x 4 columns]

### Query #1
 - What query would you run to get all the customers inside city_id = 312? Your query should return the customers' first name, last name, email, address, and city.

In [10]:
q = """SELECT customer.first_name, customer.last_name, customer.email,address.address, city.city
FROM customer
JOIN address
ON customer.address_id = address.address_id
JOIN city
ON city.city_id = address.city_id
WHERE city.city_id = 312;"""
pd.read_sql(q, conn)

,first_name,last_name,email,address,city
0,MATTIE,HOFFMAN,MATTIE.HOFFMAN@sakilacustomer.org,1497 Yuzhou Drive,London
1,CECIL,VINES,CECIL.VINES@sakilacustomer.org,548 Uruapan Street,London

### Query #2
- What query would you run to get all comedy films? Note that the genre is called the category in this schema. Your query should return, film title, description, release year, rating, and special features.

### Query #3
- What query would you run to get all the films that Johnny Lollobrigida was in? Your query should return the actor's last name, film title, and release year.

### Query #4
- What query would you run to get the first and last names of all the actors in the movie titled "Bingo Talented"?

### Query #5
- What query would you run to get the customer_id associated with all payments greater than twice the average payment amount? (HINT: use 2* in your query to get twice the amount). Your result should include the customer id and the amount.

### Query #6
- What query would you run to list the first and last names of the 5 customers who have the highest number(count) of payments? You can title the number of payments as num_payments.